Table of Contents
 Class ResultOnMembers2
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Result of member
[Obsolete]
public class ResultOnMembers2
Inheritance
object
ResultOnMembers2
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ResultOnMembers2()
Constructor
public ResultOnMembers2()
 ResultOnMembers2(ResultType)
Constructor
 Type of result
public ResultOnMembers2(ResultType resultType)
Parameters
resultType ResultType
Properties
 ResultType
Type of result
public ResultType ResultType { get; set; }
Property Value
ResultType
 Results
List of results of members
public List<ResultOfMember2> Results { get; set; }
Property Value
List<ResultOfMember2>
 Edit this page